<?php

//-------------------------------------------------------------------------
// 組み合わせのパターンを作成する（nCm）
//-------------------------------------------------------------------------
// $array 全部の要素
// $m 全要素の中から選択をする数
//-------------------------------------------------------------------------
// 例1
// $array = [1, 2, 3, 4], $m = 2
// $ret = [[1, 2], [1, 3], [1, 4], [2, 3], [2, 4], [3, 4]]
//-------------------------------------------------------------------------
function getCombinationPattern($start, $end, $m){

  $count = $end - $start + 1;
  $bit = 1<<$count;
  $ret=[];
  for($i=0;$i<$bit;$i++){
    if(gmp_popcount($i) == $m){
      $ret_elem = [];
      for($j=0;$j<$count;$j++){
        if(($i>>$j) & 1){
          $ret_elem[] = ($j + $start);
        }
      }
      $ret[] = $ret_elem;
    }
  }
  return $ret;

}



//-------------------------------------------------------------------------
// $startから$endまでの数のうち、合計が$sumになる長さ$mのIndexを返す
// 例：$start=0, $end=3, $sum=4, $m=3
// $ret = ["013","022","031","103","112","121","130","202","211","220","301","310"]
//-------------------------------------------------------------------------

/*
function getCombinationIndex($start, $end, $sum, $m){
  $ret = [];
  $now = "";
  for($i=0;$i<$m;$i++){
    getCombincationIndex($start, $end, $sum, $m);
  }
  return $ret;
}
*/